"use strict" // Строгий режим
//================================================================================================================
/*
	Задача №1
	Дано в html: три елементи з класом item.
	При кліку на кожен з елментів додати клас active,
	при повторному кліку прибрати клас 
*/
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//Задача №1

const div = document.querySelectorAll('.item')
	div.forEach(div => {
		div.addEventListener("click", () => {	
			div.classList.toggle('.active')    
		})
	})
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//================================================================================================================
//================================================================================================================
/*
	Задача №2
	Дано в css/scss: body прозорий
	При повному завантаженню сторінки додати клас до body який прибирає прозорість.
*/
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//Задача №2
window.addEventListener("load", pageLoaded)
function pageLoaded(e) {

	document.documentElement.classList.add('loaded')
}
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

//================================================================================================================
//================================================================================================================
/*
	Задача №3
	Дано в html: header main footer
	Пи наведенні курсору на header змінювати колір фону у footer.
	Коли курсор йде з header повертати початковий фон для footer.
*/
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//Задача №3
const elementHeader = document.querySelector('.header')
const elementFooter = document.querySelector('.footer')	

	elementFooter.addEventListener('mouseenter', getColir)
	elementFooter.addEventListener('mouseleave', getColirent)

	function getColir(){
			this.style.backgroundColor = '#00ff00'; // При наведении станет зелёным		
		}
	function getColirent(){
			this.style.backgroundColor = ''; // Возвратим исходный цвет, когда курсор будет удалён	
		}
	
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//================================================================================================================
//================================================================================================================
/*
	Задача №4
	Дано в html: текст, елемент з класом item, текст. Так, що елемент з класом item за межами в'юпотрта.
	Створити функцію яка будує інтервал який буде змінювати контент в елементі item виводячи цифру яка збільшується на одиницю: 1 2 3 ... і т.д.
	Затримка між зміною числа, та до якого числа має працювати інтервал має задаватись в дата атрибутах елемента item.
	Функція має запустатить коли ми доскролюємо до елементу item (його видно), і не запускатись повторно.

*/
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//Задача №4

function clearInterval(){
let i = 1
let timer = setInterval(() => {
	console.log(i)
	i === 5 ? clearInterval(timer) : null
	++i
}, 1000)
}
clearInterval()
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//================================================================================================================























